In [1]:
import pandas as pd
import numpy as np

In [2]:
train=pd.read_csv('Train.csv',engine='python')
test=pd.read_csv('Test.csv',encoding='utf-8')

In [3]:
train.shape,test.shape

((87020, 26), (37717, 24))

In [ ]:
train.dtypes

In [4]:
#combine data
train['source']= 'train'
test['source'] = 'test'
data=pd.concat([train,test],ignore_index=True)
data.head()

C:\Users\v9022828\AppData\Local\conda\conda\envs\Imagebox\lib\site-packages\ipykernel_launcher.py:4: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  after removing the cwd from sys.path.

,City,DOB,Device_Type,Disbursed,EMI_Loan_Submitted,Employer_Name,Existing_EMI,Filled_Form,Gender,ID,...,Mobile_Verified,Monthly_Income,Processing_Fee,Salary_Account,Source,Var1,Var2,Var4,Var5,source
0,Delhi,23-May-78,Web-browser,0.0,NaN,CYBOSOL,0.0,N,Female,ID000002C20,...,N,20000,NaN,HDFC Bank,S122,HBXX,G,1,0,train
1,Mumbai,07-Oct-85,Web-browser,0.0,6762.9,TATA CONSULTANCY SERVICES LTD (TCS),0.0,N,Male,ID000004E40,...,Y,35000,NaN,ICICI Bank,S122,HBXA,G,3,13,train
2,Panchkula,10-Oct-81,Web-browser,0.0,NaN,ALCHEMIST HOSPITALS LTD,0.0,N,Male,ID000007H20,...,Y,22500,NaN,State Bank of India,S143,HBXX,B,1,0,train
3,Saharsa,30-Nov-87,Web-browser,0.0,NaN,BIHAR GOVERNMENT,0.0,N,Male,ID000008I30,...,Y,35000,NaN,State Bank of India,S143,HBXX,B,3,10,train
4,Bengaluru,17-Feb-84,Web-browser,0.0,NaN,GLOBAL EDGE SOFTWARE,25000.0,N,Male,ID000009J40,...,Y,100000,NaN,HDFC Bank,S134,HBXX,B,3,17,train

In [5]:
data.shape

(124737, 27)

In [6]:
data.apply(lambda x:sum(x.isnull()))

City                      1401
DOB                          0
Device_Type                  0
Disbursed                37717
EMI_Loan_Submitted       84901
Employer_Name              113
Existing_EMI               111
Filled_Form                  0
Gender                       0
ID                           0
Interest_Rate            84901
Lead_Creation_Date           0
Loan_Amount_Applied        111
Loan_Amount_Submitted    49535
Loan_Tenure_Applied        111
Loan_Tenure_Submitted    49535
LoggedIn                 37717
Mobile_Verified              0
Monthly_Income               0
Processing_Fee           85346
Salary_Account           16801
Source                       0
Var1                         0
Var2                         0
Var4                         0
Var5                         0
source                       0
dtype: int64

In [7]:
var = ['Gender','Salary_Account','Mobile_Verified','Var1','Filled_Form','Device_Type','Var2','Source']
for v in var:
    #print '\nfrequency count of variable %s'%
    print data[v].value_counts()

SyntaxError: invalid syntax (<ipython-input-7-ed90f20ea731>, line 4)

In [8]:
len(data['City'].unique())
data.drop('City',axis=1,inplace=True)

In [9]:
data['Age']=data['DOB'].apply(lambda x:115-int(x[-2:]))
data['Age'].head()

0    37
1    30
2    34
3    28
4    31
Name: Age, dtype: int64

In [10]:
data['Age'].describe()

count    124737.000000
mean         30.906996
std           7.137860
min          18.000000
25%          26.000000
50%          29.000000
75%          34.000000
max         100.000000
Name: Age, dtype: float64

In [11]:
data.drop('DOB',axis=1,inplace=True)

In [12]:
#Majority values missing so I'll create a new variable stating whether this is missing or note:
data['EMI_Loan_Submitted_Missing'] = data['EMI_Loan_Submitted'].apply(lambda x: 1 if pd.isnull(x) else 0)
data[['EMI_Loan_Submitted','EMI_Loan_Submitted_Missing']].head(10)

   EMI_Loan_Submitted  EMI_Loan_Submitted_Missing
0                 NaN                           1
1             6762.90                           0
2                 NaN                           1
3                 NaN                           1
4                 NaN                           1
5             6978.92                           0
6                 NaN                           1
7                 NaN                           1
8            30824.65                           0
9            10883.38                           0

In [13]:
#drop original vaiables:
data.drop('EMI_Loan_Submitted',axis=1,inplace=True)

In [14]:
len(data['Employer_Name'].value_counts())

57194

In [15]:
#I'll drop the variable because too many unique values. Another option could be to categorize them manually
data.drop('Employer_Name',axis=1,inplace=True)

In [16]:
#Impute by median (0) because just 111 missing:

data['Existing_EMI'].fillna(0, inplace=True)

In [17]:
data['Interest_Rate_Missing']=data['Interest_Rate'].apply(lambda x:1 if pd.isnull(x) else 0)
print (data[['Interest_Rate','Interest_Rate_Missing']].head(10))

   Interest_Rate  Interest_Rate_Missing
0            NaN                      1
1          13.25                      0
2            NaN                      1
3            NaN                      1
4            NaN                      1
5          13.99                      0
6            NaN                      1
7            NaN                      1
8          14.85                      0
9          18.25                      0

In [18]:
data.drop('Interest_Rate',axis=1,inplace=True)

In [19]:
#Impute with median because only 111 missing:
data['Loan_Amount_Applied'].fillna(data['Loan_Amount_Applied'].median(),inplace=True)
data['Loan_Tenure_Applied'].fillna(data['Loan_Tenure_Applied'].median(),inplace=True)

In [20]:
#High proportion missing so create a new var whether present or not
data['Loan_Amount_Submitted_Missing'] = data['Loan_Amount_Submitted'].apply(lambda x: 1 if pd.isnull(x) else 0)
data['Loan_Tenure_Submitted_Missing'] = data['Loan_Tenure_Submitted'].apply(lambda x: 1 if pd.isnull(x) else 0)

In [21]:
data.drop(['Loan_Amount_Submitted','Loan_Tenure_Submitted'],axis=1,inplace=True)

In [22]:
data.drop('LoggedIn',axis=1,inplace=True)

In [23]:
#Salary account has mnay banks which have to be manually grouped
data.drop('Salary_Account',axis=1,inplace=True)

In [24]:
#High proportion missing so create a new var whether present or not
data['Processing_Fee_Missing'] = data['Processing_Fee'].apply(lambda x: 1 if pd.isnull(x) else 0)
#drop old
data.drop('Processing_Fee',axis=1,inplace=True)

In [25]:
data['Source'] = data['Source'].apply(lambda x: 'others' if x not in ['S122','S133'] else x)
data['Source'].value_counts()

S122      55249
S133      42900
others    26588
Name: Source, dtype: int64

In [26]:
data.apply(lambda x: sum(x.isnull()))

Device_Type                          0
Disbursed                        37717
Existing_EMI                         0
Filled_Form                          0
Gender                               0
ID                                   0
Lead_Creation_Date                   0
Loan_Amount_Applied                  0
Loan_Tenure_Applied                  0
Mobile_Verified                      0
Monthly_Income                       0
Source                               0
Var1                                 0
Var2                                 0
Var4                                 0
Var5                                 0
source                               0
Age                                  0
EMI_Loan_Submitted_Missing           0
Interest_Rate_Missing                0
Loan_Amount_Submitted_Missing        0
Loan_Tenure_Submitted_Missing        0
Processing_Fee_Missing               0
dtype: int64

In [ ]:
data.dtypes

## Numerical coding:

In [27]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()
var_to_encode = ['Device_Type','Filled_Form','Gender','Var1','Var2','Mobile_Verified','Source']

for col in var_to_encode:
    data[col]=le.fit_transform(data[col])

In [ ]:
data.shape

In [28]:
data=pd.get_dummies(data,columns=var_to_encode)
data.columns

Index(['Disbursed', 'Existing_EMI', 'ID', 'Lead_Creation_Date',
       'Loan_Amount_Applied', 'Loan_Tenure_Applied', 'Monthly_Income', 'Var4',
       'Var5', 'source', 'Age', 'EMI_Loan_Submitted_Missing',
       'Interest_Rate_Missing', 'Loan_Amount_Submitted_Missing',
       'Loan_Tenure_Submitted_Missing', 'Processing_Fee_Missing',
       'Device_Type_0', 'Device_Type_1', 'Filled_Form_0', 'Filled_Form_1',
       'Gender_0', 'Gender_1', 'Var1_0', 'Var1_1', 'Var1_2', 'Var1_3',
       'Var1_4', 'Var1_5', 'Var1_6', 'Var1_7', 'Var1_8', 'Var1_9', 'Var1_10',
       'Var1_11', 'Var1_12', 'Var1_13', 'Var1_14', 'Var1_15', 'Var1_16',
       'Var1_17', 'Var1_18', 'Var2_0', 'Var2_1', 'Var2_2', 'Var2_3', 'Var2_4',
       'Var2_5', 'Var2_6', 'Mobile_Verified_0', 'Mobile_Verified_1',
       'Source_0', 'Source_1', 'Source_2'],
      dtype='object')

In [ ]:
data.head()

In [29]:
train = data.loc[data['source']=='train']
test = data.loc[data['source']=='test']

In [30]:
train.head()

,Disbursed,Existing_EMI,ID,Lead_Creation_Date,Loan_Amount_Applied,Loan_Tenure_Applied,Monthly_Income,Var4,Var5,source,...,Var2_2,Var2_3,Var2_4,Var2_5,Var2_6,Mobile_Verified_0,Mobile_Verified_1,Source_0,Source_1,Source_2
0,0.0,0.0,ID000002C20,15-May-15,300000.0,5.0,20000,1,0,train,...,0,0,0,0,1,1,0,1,0,0
1,0.0,0.0,ID000004E40,04-May-15,200000.0,2.0,35000,3,13,train,...,0,0,0,0,1,0,1,1,0,0
2,0.0,0.0,ID000007H20,19-May-15,600000.0,4.0,22500,1,0,train,...,0,0,0,0,0,0,1,0,0,1
3,0.0,0.0,ID000008I30,09-May-15,1000000.0,5.0,35000,3,10,train,...,0,0,0,0,0,0,1,0,0,1
4,0.0,25000.0,ID000009J40,20-May-15,500000.0,2.0,100000,3,17,train,...,0,0,0,0,0,0,1,0,0,1

In [31]:
train.drop('source',axis=1,inplace=True)
test.drop(['source','Disbursed'],axis=1,inplace=True)

C:\Users\v9022828\AppData\Local\conda\conda\envs\Imagebox\lib\site-packages\pandas\core\frame.py:3940: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  errors=errors)

In [33]:
#train.to_csv('train_modified1.csv',index=False)
test.to_csv('test_modified.csv',index=False)